In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('exemplo.csv', sep=',')

In [3]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [4]:
df = df + 1

In [5]:
df

   Unnamed: 0   a   b   c   d
0           1   1   2   3   4
1           2   5   6   7   8
2           3   9  10  11  12
3           4  13  14  15  16

In [7]:
df.to_csv('exemplo.csv', sep=',', decimal=',')

In [14]:
df = pd.read_excel('Exemplo_Excel.xlsx')

In [15]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [16]:
df = df + 1

In [17]:
df.to_excel('exemplo.xlsx')

In [19]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [20]:
type(df)

list

In [21]:
len(df)

1

In [22]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
...,...,...,...,...,...,...,...
562,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
563,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
564,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
565,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
566,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [24]:
df[0]['Bank NameBank']

0               Heartland Tri-State Bank
1                    First Republic Bank
2                         Signature Bank
3                    Silicon Valley Bank
4                      Almena State Bank
                     ...
562                   Superior Bank, FSB
563                  Malta National Bank
564      First Alliance Bank & Trust Co.
565    National State Bank of Metropolis
566                     Bank of Honolulu
Name: Bank NameBank, Length: 567, dtype: object